CSI API ETABS v1

# cPointElmGetLocalAxes Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetLocalAxes(
    	string Name,
    	ref double A,
    	ref double B,
    	ref double C
    )

    Function GetLocalAxes (
    	Name As String,
    	ByRef A As Double,
    	ByRef B As Double,
    	ByRef C As Double
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim A As Double
    Dim B As Double
    Dim C As Double
    Dim returnValue As Integer

    returnValue = instance.GetLocalAxes(Name,
    	A, B, C)

    int GetLocalAxes(
    	String^ Name,
    	double% A,
    	double% B,
    	double% C
    )

    abstract GetLocalAxes :
            Name : string *
            A : float byref *
            B : float byref *
            C : float byref -> int

#### Parameters

Name

    Type: SystemString

A

    Type: SystemDouble

B

    Type: SystemDouble

C

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com